> @zbindenren  I just tried to reproduce the issue, but  after upgrading to new version terraform shows no changes in plan.
> 
> 
> 
> Below is the config i tried   
> 
> 
> 
> 
> 
> Terraform version: 0.13
> 
> Bigip-provider-version: 1.3.2
> 
> 
> 
> ```
> 
> terraform {
> 
>   required_providers {
> 
>     bigip = {
> 
>       source = "F5Networks/bigip"
> 
>       version = "1.3.2"
> 
>     }
> 
>   }
> 
> }
> 
> 
> 
> provider "bigip" {
> 
> xxxxxxxxxx
> 
> }
> 
> 
> 
> resource "bigip_ltm_node" "example105" {
> 
>   name        = "/Common/example105"
> 
>   description = "Terraform managed"
> 
>   address     = "10.16.177.17"
> 
>   state       = "user-up"
> 
>   monitor     = "default"
> 
> }
> 
> 
> 
> resource "bigip_ltm_pool" "e1_k8s_pfnet_lab" {
> 
>   name                = "/Common/terraform"
> 
>   load_balancing_mode = "round-robin"
> 
>   monitors            = ["/Common/http"]
> 
>   allow_snat          = "yes"
> 
>   allow_nat           = "yes"
> 
> }
> 
> 
> 
> resource "bigip_ltm_pool_attachment" "example105" {
> 
>   pool = bigip_ltm_pool.e1_k8s_pfnet_lab.name
> 
>   node = "${bigip_ltm_node.example105.name}:6443"
> 
> }
> 
> ```
> 
> ```
> 
> $ terraform init
> 
> 
> 
> Initializing the backend...
> 
> 
> 
> Initializing provider plugins...
> 
> - Using previously-installed f5networks/bigip v1.3.2
> 
> 
> 
> Terraform has been successfully initialized!
> 
> 
> 
> You may now begin working with Terraform. Try running "terraform plan" to see
> 
> any changes that are required for your infrastructure. All Terraform commands
> 
> should now work.
> 
> 
> 
> If you ever set or change modules or backend configuration for Terraform,
> 
> rerun this command to reinitialize your working directory. If you forget, other
> 
> commands will detect it and remind you to do so if necessary.
> 
> 
> 
> $ terraform --version
> 
> Terraform v0.13.5
> 
> + provider registry.terraform.io/f5networks/bigip v1.3.2
> 
> 
> 
> $ terraform apply
> 
> 
> 
> An execution plan has been generated and is shown below.
> 
> Resource actions are indicated with the following symbols:
> 
>   + create
> 
> 
> 
> Terraform will perform the following actions:
> 
> 
> 
>   # bigip_ltm_node.example105 will be created
> 
>   + resource "bigip_ltm_node" "example105" {
> 
>       + address          = "10.16.177.17"
> 
>       + connection_limit = (known after apply)
> 
>       + description      = "Terraform managed"
> 
>       + dynamic_ratio    = (known after apply)
> 
>       + id               = (known after apply)
> 
>       + monitor          = "default"
> 
>       + name             = "/Common/example105"
> 
>       + rate_limit       = (known after apply)
> 
>       + ratio            = (known after apply)
> 
>       + state            = "user-up"
> 
>     }
> 
> 
> 
>   # bigip_ltm_pool.e1_k8s_pfnet_lab will be created
> 
>   + resource "bigip_ltm_pool" "e1_k8s_pfnet_lab" {
> 
>       + allow_nat           = "yes"
> 
>       + allow_snat          = "yes"
> 
>       + id                  = (known after apply)
> 
>       + load_balancing_mode = "round-robin"
> 
>       + monitors            = [
> 
>           + "/Common/http",
> 
>         ]
> 
>       + name                = "/Common/terraform"
> 
>       + reselect_tries      = (known after apply)
> 
>       + service_down_action = (known after apply)
> 
>       + slow_ramp_time      = (known after apply)
> 
>     }
> 
> 
> 
>   # bigip_ltm_pool_attachment.example105 will be created
> 
>   + resource "bigip_ltm_pool_attachment" "example105" {
> 
>       + id   = (known after apply)
> 
>       + node = "/Common/example105:6443"
> 
>       + pool = "/Common/terraform"
> 
>     }
> 
> 
> 
> Plan: 3 to add, 0 to change, 0 to destroy.
> 
> 
> 
> Do you want to perform these actions?
> 
>   Terraform will perform the actions described above.
> 
>   Only 'yes' will be accepted to approve.
> 
> 
> 
>   Enter a value: yes
> 
> 
> 
> bigip_ltm_pool.e1_k8s_pfnet_lab: Creating...
> 
> bigip_ltm_node.example105: Creating...
> 
> bigip_ltm_node.example105: Creation complete after 2s [id=/Common/example105]
> 
> bigip_ltm_pool.e1_k8s_pfnet_lab: Creation complete after 2s [id=/Common/terraform]
> 
> bigip_ltm_pool_attachment.example105: Creating...
> 
> bigip_ltm_pool_attachment.example105: Creation complete after 1s [id=/Common/terraform-/Common/example105:6443]
> 
> 
> 
> Apply complete! Resources: 3 added, 0 changed, 0 destroyed.
> 
> ```
> 
> =====================================================================================
> 
> bigip-provider version: 1.4.0 ( upgraded )
> 
> terraform version:0.13
> 
> ======================================================================================$ 
> 
> ```
> 
> terraform {
> 
>   required_providers {
> 
>     bigip = {
> 
>       source = "F5Networks/bigip"
> 
>       version = "1.4.0"
> 
>     }
> 
>   }
> 
> }
> 
> 
> 
> provider "bigip" {
> 
> xxxxxxxxxxxxxxxx
> 
> }
> 
> 
> 
> resource "bigip_ltm_node" "example105" {
> 
>   name        = "/Common/example105"
> 
>   description = "Terraform managed"
> 
>   address     = "10.16.177.17"
> 
>   state       = "user-up"
> 
>   monitor     = "default"
> 
> }
> 
> 
> 
> resource "bigip_ltm_pool" "e1_k8s_pfnet_lab" {
> 
>   name                = "/Common/terraform"
> 
>   load_balancing_mode = "round-robin"
> 
>   monitors            = ["/Common/http"]
> 
>   allow_snat          = "yes"
> 
>   allow_nat           = "yes"
> 
> }
> 
> 
> 
> resource "bigip_ltm_pool_attachment" "example105" {
> 
>   pool = bigip_ltm_pool.e1_k8s_pfnet_lab.name
> 
>   node = "${bigip_ltm_node.example105.name}:6443"
> 
> }
> 
> 
> 
> ```
> 
> 
> 
> 
> 
> 
> 
> 
> 
> 
> 
> ```
> 
> $terraform init
> 
> 
> 
> Initializing the backend...
> 
> 
> 
> Initializing provider plugins...
> 
> - Finding f5networks/bigip versions matching "1.4.0"...
> 
> - Installing f5networks/bigip v1.4.0...
> 
> - Installed f5networks/bigip v1.4.0 (signed by a HashiCorp partner, key ID 8D69F031B13946D3)
> 
> 
> 
> Partner and community providers are signed by their developers.
> 
> If you'd like to know more about provider signing, you can read about it here:
> 
> https://www.terraform.io/docs/plugins/signing.html
> 
> 
> 
> Terraform has been successfully initialized!
> 
> 
> 
> You may now begin working with Terraform. Try running "terraform plan" to see
> 
> any changes that are required for your infrastructure. All Terraform commands
> 
> should now work.
> 
> 
> 
> If you ever set or change modules or backend configuration for Terraform,
> 
> rerun this command to reinitialize your working directory. If you forget, other
> 
> commands will detect it and remind you to do so if necessary.
> 
> 
> 
> $ terraform plan
> 
> Refreshing Terraform state in-memory prior to plan...
> 
> The refreshed state will be used to calculate this plan, but will not be
> 
> persisted to local or remote state storage.
> 
> 
> 
> bigip_ltm_pool.e1_k8s_pfnet_lab: Refreshing state... [id=/Common/terraform]
> 
> bigip_ltm_node.example105: Refreshing state... [id=/Common/example105]
> 
> bigip_ltm_pool_attachment.example105: Refreshing state... [id=/Common/terraform-/Common/example105:6443]
> 
> 
> 
> ------------------------------------------------------------------------
> 
> 
> 
> No changes. Infrastructure is up-to-date.
> 
> 
> 
> This means that Terraform did not detect any differences between your
> 
> configuration and real physical resources that exist. As a result, no
> 
> actions need to be performed.
> 
> 
> 
> ```
> 
> 
> 
> 
> 
> @zbindenren  how you have upgraded from 1.3.2 to 1.4.0 ( is it version change in terraform block  or through binary ) ?
> 
> 
> 
> 
> 
> 
I upgraded with a version change in the terraform block. But I am using terraform 0.26.x not 0.13.x. Could that be the issue? I did not loose the state, because I switched back to 1.3.2 and there were no changes again.
